Reports/ОтчетПоВзысканию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ОтчетПоВзысканию</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КолонкаКредитор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Enums/ВидыПлательщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПлательщика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Должник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СудебныйПристав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Цедент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поручитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работодатель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоступлениеПлатежа</Name>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектамВнесудебная</xr:Item>
				<xr:Item>AccumulationRegister.ИсторияПлатежей</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоСудебнымРешениям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Займ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительныйДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлательщика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлательщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеразнесеннаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СудебныеПриставы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазнесениеПоСудебнымРешениям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Решение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастьРешения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗадолженности</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыЗадолженностиПоРешению</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазнесениеПоВнесудебке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Займ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗадолженности</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ФССП_ИсполнительноеПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ФССП_ИсполнительноеПроизводство</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерИД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДолговоеОбязательствоИП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СПИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтделССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеВыезда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветчикФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозбуждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормализованныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ОтчетПоВзысканию/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Макет = Отчеты.ОтчетПоВзысканию.ПолучитьМакет("Макет");
	ТабДок.Очистить();
	
    ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(ОбластьЗаголовок);		
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ПериодОтчетаС = Строка(Формат(НачалоПериода, "ДЛФ=Д"));
	//ОбластьШапка.Параметры.ПериодОтчетаПо = Строка(Формат(КонецПериода, "ДЛФ=Д"));
	ТабДок.Вывести(ОбластьШапка);
	
	ТабДок.ФиксацияСверху = 5;
	
	
	//Подготовка таблицы с ДО подходящими по стадии
	Запрос = Новый Запрос();
	
	ТекстЗапроса =  "ВЫБРАТЬ
	                |	МАКСИМУМ(ПоступлениеПлатежа.ДатаПлатежа) КАК ДатаПлатежа,
	                |	ПоступлениеПлатежа.Займ КАК Займ
	                |ПОМЕСТИТЬ ПоследнееДСОтПристава
	                |ИЗ
	                |	Документ.ПоступлениеПлатежа КАК ПоступлениеПлатежа
	                |ГДЕ
	                |	НЕ ПоступлениеПлатежа.ПометкаУдаления
	                |	И ПоступлениеПлатежа.Проведен
	                |	И ПоступлениеПлатежа.ВидПлательщика = ЗНАЧЕНИЕ(Перечисление.ВидыПлательщика.СудебныйПристав)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ПоступлениеПлатежа.Займ
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	Займ
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	СудебноеДело.Займ.Должник КАК Должник,
	                |	СудебноеДело.Займ.Кредитор КАК Кредитор,
	                |	СудебноеДело.Займ КАК НомерДО,
	                |	СудебноеДело.ДатаИска КАК ДатаИска,
	                |	СудебноеДело.ЦенаИска КАК СуммаИска,
	                |	СудебноеДело.ДатаРешения КАК ДатаРешения,
	                |	СудебноеДелоИД.ИсполнительныйДокумент КАК НомерИД,
	                |	ПоследнееДСОтПристава.ДатаПлатежа КАК ДатаПлатежаССП,
	                |	ВЫБОР
	                |		КОГДА СудебноеДело.Отменено
	                |			ТОГДА ""Отменено: "" + СТРОКА(НАЧАЛОПЕРИОДА(СудебноеДело.ДатаОтмены, ДЕНЬ))
	                |		ИНАЧЕ ""Поворот: "" + СТРОКА(СудебноеДело.ПоворотИсполненияРешенияСуда)
	                |	КОНЕЦ КАК Действия,
	                |	СудебноеДело.ВидТребований КАК ВидТребований,
	                |	СудебноеДело.НомерДела КАК НомерДела
	                |ПОМЕСТИТЬ ДелаИД
	                |ИЗ
	                |	Документ.СудебноеДело КАК СудебноеДело
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СудебноеДело.ИД КАК СудебноеДелоИД
	                |		ПО СудебноеДело.Ссылка = СудебноеДелоИД.Ссылка
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ПоследнееДСОтПристава КАК ПоследнееДСОтПристава
	                |		ПО СудебноеДело.Займ = ПоследнееДСОтПристава.Займ
	                |			И (НЕ СудебноеДелоИД.ИсполнительныйДокумент.ПометкаУдаления)
	                |			И (НЕ СудебноеДело.ПометкаУдаления)
	                |			И (СудебноеДело.Проведен)
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	НомерИД
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ДелаИД.Должник КАК Должник,
	                |	ДелаИД.Кредитор КАК Кредитор,
	                |	ДелаИД.НомерДО КАК НомерДО,
	                |	ДелаИД.ДатаИска КАК ДатаИска,
	                |	ДелаИД.СуммаИска КАК СуммаИска,
	                |	ДелаИД.ВидТребований КАК ВидИска,
	                |	ДелаИД.ДатаРешения КАК ДатаРешения,
	                |	ДелаИД.НомерИД КАК НомерИД,
	                |	ДелаИД.ДатаПлатежаССП КАК ДатаПлатежаССП,
	                |	ДелаИД.Действия КАК Действия,
	                |	ФССП_ИсполнительноеПроизводство.Ссылка КАК НомерИП,
	                |	ФССП_ИсполнительноеПроизводство.ДатаВозбуждения КАК ДатаИП,
	                |	ДелаИД.НомерДела КАК Номер
	                |ИЗ
	                |	ДелаИД КАК ДелаИД
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФССП_ИсполнительноеПроизводство КАК ФССП_ИсполнительноеПроизводство
	                |		ПО ДелаИД.НомерИД = ФССП_ИсполнительноеПроизводство.НомерИД
	                |			И (НЕ ФССП_ИсполнительноеПроизводство.ПометкаУдаления)
	                |ГДЕ
	                |	ДелаИД.ДатаРешения <= &ДатаРешения"; 
	
	УстановитьПараметрыЗапроса(Запрос, ТекстЗапроса);
	
	Запрос.Текст = ТекстЗапроса;
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ОбластьДанных = Макет.ПолучитьОбласть("ДанныеОтчета");
		ЗаполнитьЗначенияСвойств(ОбластьДанных.Параметры, Выборка);
		ТабДок.Вывести(ОбластьДанных);
	КонецЦикла;	
	
			
			
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 НачалоПериода = ТекущаяДатаСеанса();
	
КонецПроцедуры


&НаКлиенте
Процедура РегионНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)   
	
КонецПроцедуры


&НаСервере
Процедура УстановитьПараметрыЗапроса(Запрос, ТекстЗапроса) 
	Запрос.УстановитьПараметр("ДатаРешения", ?(ЗначениеЗаполнено(НачалоПериода),НачалоПериода, Дата(1,1,1))); 
	//Если ЗначениеЗаполнено(Должник) Тогда
	//	ТекстЗапроса
	//	Запрос.УстановитьПараметр("Должник", Должник);
	//Запрос.УстановитьПараметр("ДолговоеОбязательство", ДолговоеОбязательство);
	//Запрос.УстановитьПараметр("ПустоеДО", ДолговоеОбязательство.Пустая());
	//Запрос.УстановитьПараметр("Регион", Регион);
	//Запрос.УстановитьПараметр("НеЗаполненРегион", Регион.Пустая()); 		
КонецПроцедуры
